<html>
<head>
<title>Black Sun Research Facility Tutorials</title>
<STYLE type=text/css>A:active {



        TEXT-DECORATION: none



}



A:hover {



        COLOR: #ffffff; TEXT-DECORATION: none



}



A:link {



        TEXT-DECORATION: none



}



A:visited {



        TEXT-DECORATION: none



}



.small {



        COLOR: #ffffff; FONT-FAMILY: Verdana, Arial, Helvetica, sans-serif; FONT-SIZE: 8pt; FONT-WEIGHT: bold



}



.small_uppercase {



        COLOR: #999999; FONT-FAMILY: Verdana, Arial, Helvetica, sans-serif; FONT-SIZE: 8pt



}



TD {



        COLOR: #aeaeae; FONT-FAMILY: Verdana, Arial, Helvetica, sans-serif; FONT-SIZE: 8pt



}



.7_ver_b_white {



        COLOR: #ffffff; FONT-FAMILY: Verdana, Arial, Helvetica, sans-serif; FONT-SIZE: 7pt; FONT-WEIGHT: bold



}



BODY {



        FONT-FAMILY: Verdana, Arial, Helvetica, sans-serif; FONT-SIZE: 8pt; SCROLLBAR-FACE-COLOR: #ffa534; SCROLLBAR-HIGHLIGHT-COLOR: #ffd756; SCROLLBAR-SHADOW-COLOR: #ff8312; SCROLLBAR-3DLIGHT-COLOR: #000000; SCROLLBAR-ARROW-COLOR: #ffffff; SCROLLBAR-TRACK-COLOR: #333333; SCROLLBAR-DARKSHADOW-COLOR: #000000



}



.white {



        COLOR: #ffffff; FONT-FAMILY: Verdana, Arial, Helvetica, sans-serif; FONT-SIZE: 7pt; FONT-WEIGHT: bold



}



</STYLE>
</head>
<body alink="#ffcc00" bgcolor="#000000" leftmargin="0" link="#ff9900" text="#a7a7a7" topmargin="0" vlink="#ff9900" marginwidth="0" marginheight="0">
            <TABLE border=0 cellPadding=0 cellSpacing=0 width=782>



              <TBODY>



              <TR bgColor=#ffcc00 vAlign=top>



                <TD height=1></TD></TR>



              <TR bgColor=#ff9900 vAlign=top>



                <TD>



                  <CENTER>



                  <TABLE border=0 cellPadding=0 cellSpacing=0 width="100%">



                    <TBODY>



                    <TR>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><A class=white



                        href="http://blacksun.box.sk/tutorials.html">Tutorials</A></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/byteme.html">Byte



                        Me</A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/acro.html">C.A.I.R.A</A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://dvd.box.sk/wb/index.php3?did=blacksun&amp;closed=0">Message



                        Board</A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/shelllist.html">Shells      </A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/team.html">The



                        Team</A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/chat/">Online



                        Chat</A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/links.html">Links</A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/translations.htm">Translations</A></FONT></DIV></TD>



                      <TD onmouseout="this.style.backgroundColor='#ff9900';"



                      onmouseover="this.style.backgroundColor='#FEAC01';">



                        <DIV align=center><FONT color=#000000><A class=white



                        href="http://blacksun.box.sk/books.html">Books</A>



                        </FONT></DIV></TD>

 
</TR></TBODY></TABLE></CENTER></TD></TR>



              <TR bgColor=#ff6600 vAlign=top>



                <TD height=1></TD></TR>



              <TR bgColor=#000000 vAlign=top>



                <TD height=1></TD></TR></TBODY></TABLE></TD></TR></TBODY></TABLE><br><br>
<!DOCTYPE html PUBLIC &mp;mp;quot;-//w3c//dtd html 4.0 transitional//en&mp;mp;quot;>
<HTML>
  <HEAD>
    <META content="text/html; charset=iso-8859-1">
    <TITLE>
      Mascarade d'IP
    </TITLE>
<STYLE type=text/css>A:active {
	TEXT-DECORATION: none
}
A:hover {
	TEXT-DECORATION: underline
}
A:link {
	TEXT-DECORATION: none
}
A:visited {
	TEXT-DECORATION: none
}
</STYLE>  </HEAD>
  <BODY bgcolor="#BEBCD3">
    <CENTER>
      <H1>
        Mascarade d'IP
      </H1>
    </CENTER>
    <H2>
      1 Mascarade ?
    </H2>
    <H3>
      1.1 Au sujet de ce document
    </H3>
    Ce document a une raison d'exister, celle d'apprendre aux autres. 
    <H3>
      Qui devrait lire ce document
    </H3>
    Si vous avez quelques ordinateurs &agrave; la maison, et que vous voulez partager votre connection Internet avec le reste de votre famille, ou si vous aimeriez voir votre courrier sur votre
    ordinateur de gauche, et discuter sur IRC avec votre ordinateur de droite, vous avez besoin de la "masquerade d'Ip". Oui, je sais qu'il existe des modems qui partagent les connexions pour les
    produits Microsofts. Mais l'avantage de ma m&eacute;thode est qu'elle peut fonctionner sur un 386, et avec 3 commandes , vous avez votre propre firewall. Il existe des FAI qui proposent des
    modems pour le cable et beaucoup (trop) de bande passante pour un seul ordinateur. Je pense que cela est tr&eacute;s utile. Si je veut lire mon courrier et discuter avec un ami sur IRC, il me
    suffit de tourner la t&ecirc;te. Une connection par cable n'est pas n&eacute;cessaire, un simple modem fait l'affaire (j'en suis un exemple vivant). 
    <H3>
      1.2 De quoi avez nous besoin ?
    </H3>
    Bien que je n'ai pas encore expliqu&eacute; en quoi consiste la mascarade (soyez patient), je vais commencer par expliquer dont vous avez besoin pour la mettre en place. Il vous faut: 
    <UL>
      <LI>
        Plusieurs (&gt;2) ordinateurs
      </LI>
      <LI>
        Un r&eacute;seau connectant ces ordinateurs
      </LI>
      <LI>
        Des adresses Ip diff&eacute;rentes assign&eacute;s &agrave; chaque ordinateur.
      </LI>
      <LI>
        Un Pc avec une connection Internet et un modem
      </LI>
      <LI>
        Linux, avec au moins le noyau 2.2.x install&eacute; sur cette machine
      </LI>
      <LI>
        Une demi heure &agrave; perdre (&agrave; tout casser)
      </LI>
      <LI>
        Quelque chose &agrave; manger
      </LI>
    </UL>
    Donc, maintenant que vous savez ce qui il vous faut pour la mascarade, je peut vous expliquer ce que c'est: 
    <H3>
      Qu'est ce que c'est
    </H3>
    Je sais que le processus de mascarade est complexe, donc , avant d'aborder la technique, je vais commencer avec un exemple pour &eacute;claircir les choses. Supposons que A soit amoureux de B,
    mais A n'est pas &agrave; la m&ecirc;me &eacute;cole que B et n'a pas son num&eacute;ro de t&eacute;l&eacute;phone. Il y a &eacute;galement un ami commun, C , qui connait A et qui est &agrave; la
    m&ecirc;me &eacute;cole que B. Alors A va demander &agrave; C de parler (pour obtenir son num&eacute;ro) &agrave; B , sans dire que c'est pour A. Il va faire croire que le num&eacute;ro est pour
    lui. 
    <P>
      Vous vous demandez s&ucirc;rement pourquoi j'ai choisi cette exemple ou sur quelle chaine j'ai vu cela. Eh bien, c'est tr&eacute;s simple. B est Internet, A est un client masqu&eacute; et C est
      le serveur de mascarade.
    </P>
    <P>
      Pour comprendre, je vais vous expliquer sommairement le TCP/IP. TCP/IP veut dire Tranfert Control Protocole / Internet Protocole (NdT: Protocole de Controle du Transfert / Protocole Internet )
      Il est largement utilis&eacute; pour les communications d'ordinateurs (avant TCP/IP, tous le monde utilisait UUCP = Unix to Unix Copy Protocol (NdT : Protocole de Copie de Unix &agrave; Unix).
      c'est le protocole qui se charge de vos communication r&eacute;seaux, et pour cela, il utilise des adresses IP. Une adresse IP consiste en 12 nombres group&eacute;s par 3 (NdT : en fait ,il
      s'agit de quatre octets s&eacute;par&eacute;s par des points), par exemple : 123.456.789.123. Chaque ordinateur connect&eacute; &agrave; un r&eacute;seau (et notamment &agrave; Internet)
      poss&eacute;de une adresse IP unique (NdT : au moins une , mais parfois 2 ou 3 , toujours unique). TCP/IP fonctionne de cette fa&ccedil;on:<BR>
       =&gt; Je suis 1.2.3.4 et je veut contacter 1.2.3.3<BR>
       -&gt; Je suis 1.2.3.3 , vous m'avez appel&eacute; ?<BR>
       =&gt; Je suis 1.2.3.4 et je vous ai contact&eacute;<BR>
       -&gt; Je suis 1.2.3.3 et je suis pr&ecirc;t<BR>
       =&gt; Je suis 1.2.3.4 et je veut ce fichier<BR>
       -&gt; Je suis 1.2.3.3 et j'envoie la premi&eacute;re partie du fichier &agrave; 1.2.3.4<BR>
       =&gt; Je suis 1.2.3.4 et je l'ai re&ccedil;u.<BR>
       -&gt; Je suis 1.2.3.3 et j'envoie la seconde partie du fichier &agrave; 1.2.3.4<BR>
       =&gt; Je suis 1.2.3.4 et je n'est rien re&ccedil;u<BR>
       -&gt; Je suis 1.2.3.3 et je renvoie &agrave; nouveau<BR>
       =&gt; Je suis 1.2.3.4 et je l'ai re&ccedil;u.<BR>
       -&gt; Je suis 1.2.3.3 et j'attends.<BR>
       =&gt; Je suis 1.2.3.4 et j'ai fini, bye<BR>
       -&gt; Je suis 1.2.3.3 Bye<BR>
       Je sais que cela peut sembler infantile, mais c'est comme &ccedil;a que fonctionne les communications de donn&eacute;es ( et le TCP/IP)
    </P>
    <CENTER>
      <P>
        <IMG src="networking.gif" alt="une image dun r&eacute;seau" height="200" width="400">
      </P>
    </CENTER>
    <P>
      Maintenant , vous devriez &ecirc;tre capable de comprendre l'image. Vous y voyez un ordinateur ayant pour adresse IP locale 10.0.0.1 qui est connect&eacute; &agrave; Internet par une ligne
      t&eacute;l&eacute;phonique et &agrave; qui son FAI (Fournisseur d'Acc&eacute;s Internet) a attribu&eacute; l'adresse IP 11.1.1.4. Qu'est ce que cela veut dire ? Si quelqu'un sur Internet essaye
      de contacter 11.1.1.4 ,il aura une r&eacute;ponse, mais si il essaye de contacter 10.0.0.1, il ne se passera rien, bien que ce soit le m&ecirc;me ordinateur, car l'adresse 10.0.0.1 n'est pas
      reconnu par le monde entier, elle est locale. Nous avons &eacute;galement les ordinateurs d'adresse 10.0.0.2 &agrave; 10.0.0.x qui sont connect&eacute;s &agrave; travers 10.0.0.1 .Nous pouvons
      consid&eacute;rer que 10.0.0.1 est une passerelle (un passerelle est un passage vers un autre r&eacute;seau, cela peut &ecirc;tre un lien entre 10.0.0.x et 10.0.1.x, mais dans ce cas, la
      machine doit &ecirc;tre reconnu par 10.0.0.x et 10.0.1.x , ou, en d'autre mots, doit avoir 2 cartes r&eacute;seaux, ou dans notre cas un modem et une carte r&eacute;seau). Donc, nous pouvons
      dire que c'est un portail mais il reste encore un d&eacute;tail qui emp&eacute;che 10.0.0.1 de devenir un portail Mais ce n'est pas pour la simple raison que l'internet ne le reconnait pas.<BR>
       =&gt; Je suis 10.0.0.2 et je veut vous contacter<BR>
       -&gt; Je suis 1.2.3.3 et je ne sais pas comment vous atteindre, au revoir (ce message n'est pas vraiment difus&eacute; car il n'y a pas de "route" entre les ordinateurs, il est
      enregistr&eacute;)<BR>
       Donc &agrave; quoi sert la mascarade ? Eh bien, le serveur de mascarade donne son IP (11.1.1.4, c'est celle qui a &eacute;t&eacute; attribu&eacute; par le FAI, attribu&eacute; par DHCP, par
      exemple) &agrave; la place de celle du r&eacute;seau r&eacute;seau, et se rappelle du destinataire de chaque paquet demand&eacute;. Un truc du genre:<BR>
       =&gt; Je suis 10.0.0.2 et je veut contacter 1.2.3.3<BR>
       -&gt; Je suis 10.0.0.1 et je m'occupe de cette requ&ecirc;te<BR>
       -&gt; Je suis 14.1.1.4 et je veut contacter 1.2.3.3<BR>
       _&gt; Je suis 1.2.3.3 et j'attend la commande<BR>
       J'esp&eacute;re que ceci a grandement &eacute;clairci les choses. Donc un serveur de mascarade donne son adresse IP (en fait , il masque l'adresse du sous r&eacute;seau) pour que les autres
      machines puissent acc&eacute;der &agrave; Internet. Et les donn&eacute;es entrantes sont filtr&eacute;s pour le r&eacute;seau 10.0.0.x .
    </P>
    <H2>
      2 Je hais la th&eacute;orie, filez moi un truc &agrave; taper
    </H2>
    <H3>
      2.1 Pr&eacute;parez votre syst&eacute;me
    </H3>
    Je suppose que vous avez un ordinateur o&ugrave; Linux est install&eacute;, et qu'un compte de votre fournisseur d'acc&eacute;s y est install&eacute; (si ce n'est pas le cas, regardez chez votre
    fournisseur d'acc&eacute;s comment faire). En plus, il vous faudra des connaissances de bases sur Linux, du type "comment compiler votre propre noyau (kernel)". Tout ce qui est expos&eacute; ici
    n'est valable que si la version de votre noyau est 2.2.x , car la mascarade a subi quelques changement ces derniers temps. Si vous ne poss&eacute;dez au moins une version 2.2.x de votre noyau, je
    vous conseille de le mettre &agrave; jour. En effet, de vieux noyaux contiennent quelques bugs, peuvent ne pas reconnaitre le nouveau mat&eacute;riel et rendre votre syst&eacute;me
    vuln&eacute;rable &agrave; certaines attaques. La derni&eacute;re version du noyau est disponible sur <A href="ftp://ftp.kernel.org">ftp.kernel.org</A> (je vais vous expliquer ici les bases) <BR>
     <I>[GoMoRRaH@SaTaN GoMoRRaH]$ mv mykernel.tar.gz /usr/src/</I> <BR>
     <I>[GoMoRRaH@SaTaN GoMoRRaH]$ cd /usr/src</I> <BR>
     <I>[GoMoRRaH@SaTaN src]$ rm linux (efface les "symbolics links"(NdT : liens symboliques ?) vers les anciens fichiers sources du noyau)</I> <BR>
     <I>[GoMoRRaH@SaTaN src]$ tar -zxvf mykernel.tar.gz</I> <BR>
     <I>(votre noyau est maintenant extrait dans le repertoire linux, par d&eacute;faut)</I> <BR>
     <I>[GoMoRRaH@SaTaN src]$ cd linux</I> <BR>
     <I>[GoMoRRaH@SaTaN linux]$ make menuconfig</I> <BR>
     (vous avez le choix, tapez: make config pour une interface en mode texte , tapez: make menuconfig pour une interface graphique et: make xconfig pour une interface sous X-windows) <BR>
     Maintenant vous pouvez voir toutes les options possibles, cela d&eacute;pend du syst&eacute;me, * signifie support et M signifie modules, les modules sont des morceaux du code du noyau qui
    peuvent &ecirc;tre compil&eacute; n'importe quand, plus tard) Mais vous devez obligatoirement dire OUI &agrave; ce qui suit (NdT : non traduit pour plus de clart&eacute;): 
    <P>
      =&gt; Prompt for development and or incomplete code / drivers<BR>
       =&gt;Enable loadable module support<BR>
       =&gt;Networking support<BR>
       =&gt;Network firewalls<BR>
       =&gt;TCP/IP Networking<BR>
       =&gt;IP:forwarding/gatewaying<BR>
       =&gt;IP:firewalling<BR>
       =&gt;IP:masquerading<BR>
       =&gt;IP:ipportfw masq support<BR>
       =&gt;IP:ipautofw masq support<BR>
       =&gt;IP:ICMP masquerading<BR>
       =&gt;IP:always defragment<BR>
       =&gt;Dummy net driver support<BR>
       =&gt;IP:ip fwmark masq-forwarding support
    </P>
    <P>
      Notez que cela ne repr&eacute;sente que les options n&eacute;cessaires &agrave; la mascarade, vous avez besoin d'autre options pour votre noyau. Quand tout est fini, on vous demandera si vous
      souhaitez appliquer les changements. Les commandes suivantes compilent le noyau et peuvent prendre 10 &agrave; 40 minutes, pendant lesquelles s'afficheront peut &ecirc;tre des messages
      incompr&eacute;hensibles sur votre &eacute;cran, mais ne vous inqui&eacute;tez pas, c'est normal..<BR>
       <I>[GoMoRRaH@SaTaN linux]$ make dep</I><BR>
       <I>[GoMoRRaH@SaTaN linux]$ make clean</I><BR>
       <I>[GoMoRRaH@SaTaN linux]$ make bzImage</I><BR>
       <I>[GoMoRRaH@SaTaN linux]$ cp /usr/src/linux/arch/i386/boot/bzImage /boot/kernel</I><BR>
       <I>[GoMoRRaH@SaTaN linux]$ make modules</I><BR>
       <I>[GoMoRRaH@SaTaN linux]$ make modules_install</I><BR>
       Arriv&eacute; ici , vous devez &eacute;diter votre fichier <I>/etc/lilo.conf</I>. Il faut ajouter quelque chose dans le genre de ceci<BR>
       image=/boot/kernel<BR>
       label=masqkernel<BR>
       root=/dev/hdax (placer ici votre partition/disque dur/syst&eacute;me de fichier/.. principale)<BR>
       read-only<BR>
       Ceci permettra &agrave; votre gestionnaire de boot de trouver votre nouveau noyau au d&eacute;marrage. Donc, la prochaine fois que vous voyez le prompt de Lilo, vous devrez taper <I>
      masqkernel</I> pour utiliser le noyau permettant la mascarade.<BR>
       <I>[GoMoRRaH@SaTaN linux]$ lilo</I><BR>
       <I>added linux-2.2.5-15 *</I><BR>
       <I>added dos</I><BR>
       <I>added masqkernel</I><BR>
       Maintenant vous devez modifier le fichier <I>/etc/rc.d/rc.local</I> pour que les modules soit charg&eacute; automatiquement au d&eacute;marrage<BR>
       .<BR>
       .<BR>
       /sbin/depmode -a<BR>
       /sbin/modprobe ip_masq_ftp<BR>
       /sbin/modprobe ip_masq_raudio<BR>
       /sbin/modprobe ip_masq_irc<BR>
       .<BR>
       .<BR>
       Ces modules permettent la mascarade pour l'IRC, le FTP et le Real Audio. Il reste une derni&eacute;re chose &agrave; faire avant de rebooter, d'activer l' IPV4 forwarding (NdT : transmission
      IpV4 ?).<BR>
       <I>[GoMoRRaH@SaTaN linux] echo "1" &gt; /proc/sys/net/ip_forward</I> Il ne reste plus qu'&agrave; rebooter votre syst&eacute;me pour profiter de votre tout nouveau noyau. V&eacute;rifiez que
      tout d&eacute;marre correctement, si ce n'est pas le cas, il vous faudra recommencer les &eacute;tapes pr&eacute;c&eacute;dentes, jusqu'&agrave; ce que vous ayez un noyau qui fonctionne.
    </P>
    <H3>
      Commencer la mascarade
    </H3>
    En fait, une fois le noyau en place, il n'y a plus grand chose &agrave; faire. Il suffit juste de vous connecter chez votre FAI, et de taper 2 commandes. Elle permettent de r&eacute;gler votre
    "politique" de tranmission (NdT : forwarding)<I>[GoMoRRaH@SaTaN GoMoRRaH]$ ipchains -P forward DENY</I> <BR>
     <I>[GoMoRRaH@SaTaN GoMoRRaH]$ ipchains -A forward -s 10.0.0.0/4 -j MASQ</I> <BR>
     Pour que ces commandes marchent sur votre r&eacute;seau, il suffit d'ajuster le param&eacute;tre -s, en remplacant 10.0.0.0 par l'adresse du r&eacute;seau et 4 par la plus grande adresse IP
    &agrave; masquer. Votre serveur devrait maintenant fonctionner. Et oui, il y une tonne de th&eacute;orie et de pr&eacute;paration avec le noyau, et il suffit de 2 lignes de commandes pour faire
    fonctionner le serveur. 
    <H3>
      Configurer les clients
    </H3>
    Vous avez un serveur, mais qu'est ce qu'un serveur sans client? A quoi sert un supermarch&eacute; sans consommateur? Vous n'avez pas grand chose &agrave; configurer, mais il ne faut pas
    l'oublier. Vos clients doivent avoir comme portail l'adresse de votre serveur (ici 10.0.0.1). Cela doit se trouver parmi les options concernant le r&eacute;seau, et ne devrai pas &ecirc;tre trop
    difficile &agrave; trouver. 
    <H2>
      3 G&eacute;neral
    </H2>
    <B>Autres sources d'informations</B> <BR>
     Si vous voulez en savoir plus sur le r&eacute;seau sous Linux, ou sur Linux en g&eacute;n&eacute;ral, allez voir les documents publi&eacute;s par le LDP (Linux documentation Project, projet de
    documentation de Linux). Ils ont publi&eacute;s un guide de l'administrateur r&eacute;seau, un guide de l'administrateur syst&eacute;me, un guide du programmeur, et de nombreux HOWTO's. Ils sont
    fournis avec chaque distribution de Linux et valent vraiment le coup. 
    <P>
      Si vous avez des questions, vous pouvez m'&eacute;crire, <A href="mailto:metal@digibel.org">GoMoRRaH</A> , un membre du <I><A href="http://blacksun.box.sk">Black Sun Research Facility</A></I>
    </P>
  </BODY>
</HTML>

<HR align=center width="100%" noShade SIZE=1>
<center>&copy 2001 Blacksun Research Facility. All rights reserved.<br></center>
</body>
</html>